Revit 2024 API
BuiltInFailures.StairRampFailures.StairsZeroDesiredRisers Property
 The number of desired risers for a staircase cannot be 0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsZeroDesiredRisers { get; }
Visual Basic
Public Shared ReadOnly Property StairsZeroDesiredRisers As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsZeroDesiredRisers {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace